testing/load/scenarios/create-order.yml
# Create Order Load Test
# Simula creación de órdenes: 100 órdenes por minuto

config:
  target: '{{ $processEnvironment.TARGET_URL || "http://localhost:3001" }}'
  
  phases:
    # 100 órdenes por minuto = ~1.67 órdenes por segundo
    - name: 'Normal order rate'
      duration: 300
      arrivalRate: 2
      rampTo: 2
    
    # Pico de órdenes: Black Friday simulation
    - name: 'Order spike - Black Friday'
      duration: 120
      arrivalRate: 10
    
    # Vuelta a la normalidad
    - name: 'Back to normal'
      duration: 180
      arrivalRate: 2

  defaults:
    headers:
      Content-Type: 'application/json'
      Authorization: 'Bearer {{ $processEnvironment.TEST_TOKEN || "test-token" }}'

  plugins:
    ensure:
      thresholds:
        - http.response_time.p95: 1000
        - http.response_time.p99: 2000
    
    metrics-by-endpoint:
      useOnlyRequestNames: true

  processor: './functions.js'

scenarios:
  - name: 'Complete order flow'
    weight: 70
    flow:
      # Paso 1: Agregar items al carrito
      - post:
          url: '/api/v1/cart/items'
          json:
            productId: '{{ $randomItem(["550e8400-e29b-41d4-a716-446655440001", "550e8400-e29b-41d4-a716-446655440002", "550e8400-e29b-41d4-a716-446655440003"]) }}'
            quantity: '{{ $randomInt(1, 5) }}'
      
      - think: 2
      
      # Paso 2: Ver carrito
      - get:
          url: '/api/v1/cart'
      
      - think: 3
      
      # Paso 3: Crear orden
      - post:
          url: '/api/v1/orders'
          json:
            items:
              - productId: '550e8400-e29b-41d4-a716-446655440001'
                quantity: 1
                price: 99.99
              - productId: '550e8400-e29b-41d4-a716-446655440002'
                quantity: 2
                price: 49.99
            shippingAddress:
              street: '{{ $randomString() }} Test St'
              city: 'Test City'
              state: 'CA'
              zipCode: '90210'
              country: 'US'
            paymentMethod: 'credit_card'
          capture:
            - json: '$.id'
              as: 'orderId'
            - json: '$.totalAmount'
              as: 'orderTotal'
      
      - think: 1
      
      # Paso 4: Verificar orden creada
      - get:
          url: '/api/v1/orders/{{ orderId }}'

  - name: 'Quick order'
    weight: 20
    flow:
      - post:
          url: '/api/v1/orders'
          json:
            items:
              - productId: '{{ $randomItem(["550e8400-e29b-41d4-a716-446655440001", "550e8400-e29b-41d4-a716-446655440002"]) }}'
                quantity: 1
                price: 99.99
            shippingAddress:
              street: '123 Quick St'
              city: 'Quick City'
              state: 'CA'
              zipCode: '90210'
              country: 'US'
            paymentMethod: 'credit_card'

  - name: 'Bulk order (B2B)'
    weight: 10
    flow:
      - post:
          url: '/api/v1/orders'
          json:
            items:
              - productId: '550e8400-e29b-41d4-a716-446655440001'
                quantity: 50
                price: 89.99
              - productId: '550e8400-e29b-41d4-a716-446655440002'
                quantity: 100
                price: 44.99
            shippingAddress:
              street: '456 Business Ave'
              city: 'Business City'
              state: 'CA'
              zipCode: '90210'
              country: 'US'
            paymentMethod: 'wire_transfer'
            orderType: 'b2b'